#########################################
#
# 行動計量学会第19回春の合宿セミナー
#　　サンプルスクリプト
#      Lesson 2 Rの基本操作(後半)
#
#　　(c) Koij Kosugi(@kosugitti)
#
#########################################

# 数値例を発生
set.seed(12345)
# 標準正規分布から発生する100個の乱数をつくってみる
x100 <- rnorm(100,0,1)
mean(x100)        # 平均値
var(x100)         # 分散
sd(x100)          # 標準偏差
max(x100)         # 最大値
min(x100)         # 最小値
median(x100)      # 中央値

# パーセンタイル
# 0%, 25%, 50%, 75%, 100%
quantile(x100,probs=c(0,0.25,0.5,0.75,1))

################

# 最頻値の関数はないのでヒストグラムから作る
h1 <- hist(x100)
h1$mids[which.max(h1$counts)]
# 階級幅を変える
h2 <- hist(x100,breaks=seq(-5,5,0.1))
h2$mids[which.max(h2$counts)]
# 階級幅が違うと最頻値は変わる
h3 <- hist(x100,breaks=seq(-5,5,1))
h3$mids[which.max(h3$counts)]

################
# 毎回答えが違う
x100.1 <- rnorm(100,0,1)
x100.2 <- rnorm(100,0,1)
x100.3 <- rnorm(100,0,1)

mean(x100.1)
mean(x100.2)
mean(x100.3)

# サンプルサイズを増やすと理論値に近づく
x1000 <-  rnorm(1000,0,1)
mean(x1000)

x10000 <- rnorm(10000,0,1)
mean(x10000)

x100000 <-  rnorm(100000,0,1)
mean(x100000)


quantile(x100000,probs=c(0,0.25,0.33,0.75,1))
qnorm(0.25,0,1)
qnorm(0.33,0,1)
qnorm(0.75,0,1)
